# __SQL Exercise__ (Python Connector)
<hr>

#### - Create _connection_ Python with your SQL Database!
#### - Use ``Sakila`` database!
#### - If there isn't ``Sakila`` in your SQL Dataset, follow this guidance: https://dev.mysql.com/doc/sakila/en/sakila-installation.html

___

## Import Libraries

In [ ]:
import mysql.connector
import pandas as pd

## Create Connection

In [ ]:
## Kita membuat koneksi ke MYSQL db
mydb = mysql.connector.connect( host= "localhost"             # host mysql saya
                , user= "root"                 # username mysql saya
                , password= ""                 # password mysql saya
                , database= "sakila"      # database yg kita buat
                )

In [ ]:
cursor = mydb.cursor()

In [ ]:
# Create function
def sql_df(yourQuery):
    cursor.execute(yourQuery)
    res = cursor.fetchall()
    df = pd.DataFrame(res, columns = cursor.column_names)
    return df

In [ ]:
sql_df('SELECT * FROM `language`')

## ``Tampilkan seluruh tabel di Database Sakila (Full Table)``

In [ ]:
sql_df('show full tables')

In [ ]:
sql_df('select * from rental limit 2')

In [ ]:
sql_df('select * from customer limit 2')

In [ ]:
sql_df('select * from address limit 2')

In [ ]:
sql_df('select * from country limit 2')

<hr>

## __Soal__

### 1. Tampilkan aktor yang memiliki nama depan ‘Scarlett’!

In [ ]:
sql_df(
    """
    SELECT first_name as Nama_Depan, last_name as Nama_Belakang
    FROM actor 
    WHERE first_name='Scarlett'
    """)

### 2. Tampilkan aktor yang memiliki nama belakang ‘Johansson’!

In [ ]:
sql_df(
    """
    SELECT first_name as Nama_Depan, last_name as Nama_Belakang
    FROM actor 
    WHERE last_name='Johansson'
    """)

### 3. Berapa banyak nama terakhir aktor (tanpa ada pengulangan/_distint_)?

In [ ]:
sql_df(
    """
    SELECT count(distinct last_name) as Jumlah_Nama_Terakhir
    FROM actor;
    """)

### 4. Tampilkan nama belakang aktor yang keluar hanya satu kali di database Sakila!¶

In [ ]:
sql_df(
    """
    SELECT last_name as Nama_Belakang
    FROM actor 
    GROUP BY last_name 
    HAVING count(*) = 1;
    """).head()

### 5. Tampilkan nama belakang aktor yang keluar lebih dari satu kali di database Sakila!

In [ ]:
sql_df("""
SELECT last_name as Nama_Belakang
FROM actor
GROUP BY last_name 
HAVING count(*) > 1;
""").head()

### 6. Tahun berapa film ‘Academy Dinosaur’ di-_release_?

In [ ]:
sql_df("""
SELECT title as Judul, release_year as Tahun_Release
FROM film
WHERE title = 'Academy Dinosaur'
""")

### 7. Berapa rata-rata durasi film di database Sakila?

In [ ]:
sql_df("""
SELECT avg(length) as Rata_Durasi
FROM film;
""")

### 8. Tampilkan rata-rata durasi film di tiap kategori film!

In [ ]:
sql_df("""
SELECT category.name AS Category
, avg(length) AS Avg_Duration
FROM film 
join film_category using (film_id) 
join category using (category_id)
GROUP BY category.name
ORDER BY avg(length) desc;
""")

### 9. Tampilkan kategori film yang memiliki rata-rata durasi (_average of length_) di atas rata-rata kategori film lainnya!

In [ ]:
sql_df("""
SELECT category.name as Category
, avg(length) as Avg_Duration
from film 
join film_category using (film_id) 
join category using (category_id)
group by category.name
having 
avg(length) > (select avg(length) from film)
order by avg(length) desc;
""")

### 10. Berapa banyak customer yang dilayani oleh 2 staff di Sakila Database?

In [ ]:
sql_df('''
SELECT a.name as Staff
, COUNT(b.customer_id) as Total_Customer
FROM staff_list as a
, rental as b
WHERE a.ID = b.staff_id
GROUP BY Name
''')

### 11. Tampilkan _total order_ (jumlah penyewaan) setiap kategori film!

In [ ]:
sql_df("""
SELECT category.name AS Category, 
count(rental.rental_id) AS Total_Order
FROM rental join inventory using (inventory_id) 
join film_category using (film_id) 
join category using (category_id)
GROUP BY category.name
ORDER BY Total_Order desc;
""")

### 12. Tampilkan 5 kota dengan total order (jumlah penyewaan) terbesar!

In [ ]:
sql_df("""
SELECT city.city as Nama_Kota
, count(rental.rental_id) as Total_Order

FROM rental 
JOIN customer USING (customer_id) 
JOIN address USING (address_id) 
JOIN city USING (city_id)

GROUP BY Nama_Kota
ORDER BY Total_Order DESC
LIMIT 5
""")